<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Bartender 5.</string>
	<key>Identifier</key>
	<string>com.github.techjedi51.download.Bartender5</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Bartender 5</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
<key>Process</key>
    <array>
        <!-- Step 1: Extract the download URL from the appcast XML -->
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.macbartender.com/B2/updates/AppcastB5.xml</string>
                <key>re_pattern</key>
                <string>(https://macbartender.com/B2/updates/[^"]+/Bartender[^\"]+.zip)</string>
                <key>result_output_var_name</key>
                <string>download_url</string>
            </dict>
        </dict>

        <!-- Step 2: Extract the version number from the URL -->
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%download_url%</string>
                <key>re_pattern</key>
                <string>updates/([0-9.-]+)/Bartender</string>
                <key>version_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>

        <!-- Step 3: Download the extracted URL -->
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%download_url%</string>
                <key>filename</key>
                <string>Bartender.zip</string>
            </dict>
        </dict>

        <!-- Step 4: End the check phase -->
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
