<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.techjedi51.munki.LibreOffice-Apple-Silicon</string>
    <key>ParentRecipe</key>
    <string>com.github.techjedi51.download.LibreOffice-Apple-Silicon</string>
    <key>Input</key>
    <dict>
        <key>NAME</key><string>LibreOffice</string>
        <key>MUNKI_REPO_SUBDIR</key><string>apps/LibreOffice</string>
        <key>pkginfo</key>
        <dict>
            <key>name</key><string>LibreOffice-AppleSilicon</string>
            <key>display_name</key><string>LibreOffice (Apple Silicon)</string>
            <key>description</key><string>LibreOffice productivity suite for Apple Silicon Macs</string>
            <key>developer</key><string>The Document Foundation</string>
            <key>catalogs</key><array><string>testing</string></array>
            <key>unattended_install</key><true/>
            <key>minimum_os_version</key><string>11.0</string>
            <key>supported_architectures</key><array><string>arm64</string></array>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <!-- Verify signature -->
        <dict>
            <key>Processor</key><string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key><string>%pathname%/LibreOffice.app</string>
                <key>requirement</key>
                <string>identifier "org.libreoffice.script" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7P5S3ZLCN7"</string>
            </dict>
        </dict>

        <!-- Extract version from Info.plist -->
        <dict>
            <key>Processor</key><string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key><string>%pathname%/LibreOffice.app/Contents/Info.plist</string>
                <key>plist_version_key</key><string>CFBundleShortVersionString</string>
            </dict>
        </dict>

        <!-- Import into Munki -->
        <dict>
            <key>Processor</key><string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key><string>%pathname%</string>
                <key>version</key><string>%version%</string>
                <key>repo_subdirectory</key><string>%MUNKI_REPO_SUBDIR%</string>
                <key>name</key><string>LibreOffice-AppleSilicon</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
