<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.techjedi51.download.LibreOffice-AppleSilicon</string>
    <key>Description</key>
    <string>Downloads the latest Apple Silicon build of LibreOffice</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_PAGE</key>
        <string>https://www.libreoffice.org/download/download-libreoffice/</string>
    </dict>
    <key>Process</key>
    <array>
        <!-- Step 1: Fetch page content -->
        <dict>
            <key>Processor</key><string>URLGetter</string>
            <key>Arguments</key>
            <dict>
                <key>url</key><string>%DOWNLOAD_PAGE%</string>
            </dict>
        </dict>

        <!-- Step 2: Extract Apple Silicon .dmg URL -->
        <dict>
            <key>Processor</key><string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>input_text</key><string>%url_content%</string>
                <key>re_pattern</key>
                <string>href="(https://[^"]+MacOS_aarch64\.dmg)"</string>
                <key>result_output_var_name</key><string>download_url</string>
            </dict>
        </dict>

        <!-- Step 3: Download the .dmg -->
        <dict>
            <key>Processor</key><string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key><string>%download_url%</string>
                <key>filename</key><string>LibreOffice-AppleSilicon.dmg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
