<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Zoom Universal Installer for IT and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.techjedi51.munki.zoom.us</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>zoom.us</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>ZoomClips.app</string>
				<string>caphost.app</string>
				<string>airhost.app</string>
				<string>ZoomPhone.app</string>
				<string>aomhost.app</string>
				<string>Transcode.app</string>
				<string>zoom.us.app</string>
				<string>ZoomAutoUpdater.app</string>
				<string>ZoomUninstaller.app</string>
				<string>ZMScreenshot.app</string>
				<string>CptHost.app</string>
				<string>zCCIMeetingHost.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>This app is the Mac client for cloud-based HD video meeting service Zoom.us.</string>
			<key>developer</key>
			<string>Zoom Video Communications, Inc.</string>
			<key>display_name</key>
			<string>zoom.us</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.techjedi51.download.zoom.us</string>
	<key>Process</key>
	<array>
		<dict>
		    <key>Arguments</key>
		    <dict>
		        <key>pkg_path</key>
		        <string>%pathname%</string>
		        <key>version</key>
		        <string>%version%</string> <!-- ADD THIS -->
		        <key>repo_subdirectory</key>
		        <string>%MUNKI_REPO_SUBDIR%</string>
		    </dict>
		    <key>Processor</key>
		    <string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
