<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Ecamm Live and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.techjedi51.munki.EcammLive</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Ecamm Live</string>
		<key>NAME</key>
		<string>Ecamm Live</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>The leading live streaming & video production studio built for Mac. The ultimate Zoom Camera system.</string>
			<key>developer</key>
			<string>Ecamm Network, LLC</string>
			<key>display_name</key>
			<string>Ecamm Live</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.techjedi51.download.EcammLive</string>
	<key>Process</key>
	<array>
        <dict>
        	<key>Processor</key>
        	<string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/EcammLive.dmg</string>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/downloads/Applications/Ecamm Live.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/EcammLive.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%dmg_path%</string>
                    <string>%RECIPE_CACHE_DIR%/downloads/Applications/</string>
                </array>
            </dict>
        </dict>
	</array>
</dict>
</plist>
