<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Ecamm Live.</string>
	<key>Identifier</key>
	<string>com.github.techjedi51.download.EcammLive</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>EcammLive</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
	<!-- Step 1: Download the ZIP file -->
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>url</key>
                <string>https://zip.ecammdownloads.com/EcammLive.zip</string>
            </dict>
        </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <!-- Step 2: Unarchive the ZIP file -->
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/Applications</string>
		<key>purge_destination</key>
		<true/>
            </dict>
        </dict>
       <!-- Step 3: Use FileFinder to locate the folder that contains Ecamm Live.app -->
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/downloads/Applications/*/Ecamm*.app</string> <!-- Look for the .app inside the extracted folder -->
                <key>path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/Applications</string> <!-- Search in the unarchived directory -->
            </dict>
            <key>output_variable</key>
            <string>found_filename</string> <!-- Store the full path to the .app -->
        </dict>
      <!-- Step 4: Extract the version number from the Info.plist -->
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%found_filename%/Contents/Info.plist</string> <!-- Use the located .app path -->
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string> <!-- Extract the version -->
            </dict>
        </dict>
        <!-- Step 5: Check the app -->
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%found_filename%</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.ecamm.EcammLive" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5EJH68M642")</string>
            </dict>
        </dict> 
	</array>
</dict>
</plist>
