<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.techjedi51.munki.8x8work.silicon</string>
    <key>ParentRecipe</key>
    <string>com.github.techjedi51.download.8x8work.silicon</string>
    <key>Input</key>
    <dict>
        <key>NAME</key><string>8x8 Work (Silicon)</string>
        <key>MUNKI_REPO_SUBDIR</key><string>apps/8x8 Work</string>
        <key>pkginfo</key>
        <dict>
            <key>name</key><string>8x8 Work (Silicon)</string>
            <key>description</key><string>Apple Silicon build of 8x8 Work</string>
            <key>developer</key><string>8x8, Inc.</string>
            <key>catalogs</key>
            <array><string>testing</string></array>
            <key>unattended_install</key><true/>
            <key>supported_architectures</key>
                <array>
                    <string>arm64</string>
                </array>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key><string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>name</key>
                <string>8x8Work-Silicon</string>
                <key>version</key><string>%version%</string>
                <key>pkg_path</key><string>%pathname%</string>
                <key>repo_subdirectory</key><string>%MUNKI_REPO_SUBDIR%</string>
                <key>additional_package_name_components</key>
                <array>
                    <string>Silicon</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
