<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>net.sealsystems.munki.8x8work.silicon</string>
    <key>ParentRecipe</key>
    <string>net.sealsystems.download.8x8work.silicon</string>
    <key>Input</key>
    <dict>
        <key>NAME</key><string>8x8 Work (Silicon)</string>
        <key>MUNKI_REPO_SUBDIR</key><string>apps/8x8 Work</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key><string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key><string>%pathname%</string>
                <key>repo_subdirectory</key><string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
